<a href="https://colab.research.google.com/github/Rido843/Basic-Python-Programming-for-Data-Science/blob/main/%5BC%5D_Rido_Trimanto.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Tantangan**

In [ ]:
import numpy as np
import pandas as pd

x = int(input('Masukkan Nilai Minimal = '))
y = int(input('Masukkan Nilai Maksimal= '))
k = int(input('Masukkan Jumlah Kelas = '))
n = k-1
z = (y-x)/n
def lawan():
  batas_bawah=list(np.arange(x,y+z,step=z))
  batas_atas=list(np.arange(x+z,y+2*z,step=z))
  kelas = []
  for i in range(1,n+2):
    U='U'
    kelas.append((U+str(i)))
  rata = list((np.arange(x+z,y+2*z,step=z)+np.arange(x,y+z,step=z))/2)
  dict1={"Kelas":kelas,"Batas Bawah":batas_bawah, "Batas Atas":batas_atas, "Nilai Tengah":rata}
  df = pd.DataFrame(dict1)
  return df
lawan()

Masukkan Nilai Minimal = 1
Masukkan Nilai Maksimal= 10
Masukkan Jumlah Kelas = 5

  Kelas  Batas Bawah  Batas Atas  Nilai Tengah
0    U1         1.00        3.25         2.125
1    U2         3.25        5.50         4.375
2    U3         5.50        7.75         6.625
3    U4         7.75       10.00         8.875
4    U5        10.00       12.25        11.125